docs-html/document-structure.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Document Structure</title>
<meta name="author" content="Scimax VS Code Team" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.9.0/styles/default.min.css" />
</head>
<body>
<main class="org-content">
<header id="title-block">
<h1 class="title">Document Structure</h1>
<p class="author">Scimax VS Code Team</p>
<p class="date">2026-01-13</p>
</header>
<div id="org-document-structure" class="org-section org-level-1">
<h1>✅ Document Structure</h1>
<p>CLOSED: [2026-01-15 Thu 14:25]</p>

<p>Org documents are structured around <strong>headlines</strong>, which create a hierarchical
outline that can be folded, navigated, and manipulated. This chapter covers how
to create and work with document structure in Scimax VS Code.</p>

</div>
<div id="org-headlines" class="org-section org-level-1">
<h1>✅ Headlines</h1>
<p>CLOSED: [2026-01-15 Thu 14:25]</p>

<p>Headlines are the backbone of org documents. They define the structure and allow
for powerful outline-based navigation and organization.</p>

<div id="org-creating-headlines" class="org-section org-level-2">
<h2>✅ Creating Headlines</h2>
<p>CLOSED: [2026-01-15 Thu 14:25]</p>

<p>A headline starts with one or more asterisks (*) at the beginning of a line,
followed by a space:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* Top Level Headline
,** Second Level
,*** Third Level
,**** Fourth Level</code></pre>
</div>

<p>There is no hard limit on headline levels, but most documents use 3-5 levels.</p>

</div>
<div id="org-headline-components" class="org-section org-level-2">
<h2>✅ Headline Components</h2>
<p>CLOSED: [2026-01-15 Thu 14:25]</p>

<p>A headline can contain several components:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* TODO [#A] Headline Title                                    :tag1:tag2:</code></pre>
</div>

<table class="org-table">
<thead>
<tr><th>Component</th><th>Description</th><th>Example</th></tr>
</thead>
<tbody>
<tr><td>Stars</td><td>Define the level (required)</td><td>*, **, ***</td></tr>
<tr><td>TODO keyword</td><td>Task state (optional)</td><td>TODO, DONE</td></tr>
<tr><td>Priority</td><td>Importance marker (optional)</td><td>[#A], [#B]</td></tr>
<tr><td>Title</td><td>The headline text (required)</td><td>Any text</td></tr>
<tr><td>Tags</td><td>Categorization labels (optional)</td><td>:work:urgent:</td></tr>
</tbody>
</table>

</div>
<div id="org-headline-levels" class="org-section org-level-2">
<h2>✅ Headline Levels</h2>
<p>CLOSED: [2026-01-15 Thu 14:26]</p>

<p>Headlines can be nested to any depth:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* Level 1: Main Section
,** Level 2: Subsection
,*** Level 3: Sub-subsection
,**** Level 4: Paragraph grouping
,***** Level 5: Fine detail</code></pre>
</div>

<p>Use consistent levels throughout your document. Skipping levels (e.g., going
from * to ***) works but may cause confusion.</p>

</div>
</div>
<div id="org-visibility-cycling" class="org-section org-level-1">
<h1>✅ Visibility Cycling</h1>
<p>CLOSED: [2026-01-15 Thu 14:26]</p>

<p>One of the most powerful features of org documents is the ability to fold
(collapse) and unfold (expand) sections to manage complexity.</p>

<div id="org-folding-with-tab" class="org-section org-level-2">
<h2>✅ Folding with Tab</h2>
<p>CLOSED: [2026-01-15 Thu 14:26]</p>

<p>Press Tab on a headline to cycle through visibility states:</p>

<table class="org-table">
<thead>
<tr><th>State</th><th>Shows</th></tr>
</thead>
<tbody>
<tr><td>Folded</td><td>Only the headline, children hidden</td></tr>
<tr><td>Children</td><td>Headline and immediate child headlines</td></tr>
<tr><td>Subtree</td><td>All content under this headline</td></tr>
</tbody>
</table>

<p>Example cycle:</p>

<ol>
<li><p>* Heading... (folded - ellipsis shows hidden content)</p>
</li>
<li><p>* Heading with child headlines visible</p>
</li>
<li><p>* Heading with all content visible</p>
</li>
</ol>

</div>
<div id="org-global-cycling-with-shift-tab" class="org-section org-level-2">
<h2>✅ Global Cycling with Shift-Tab</h2>
<p>CLOSED: [2026-01-15 Thu 14:26]</p>

<p>Press Shift+Tab anywhere in the document to cycle global visibility:</p>

<table class="org-table">
<thead>
<tr><th>State</th><th>Shows</th></tr>
</thead>
<tbody>
<tr><td>Overview</td><td>Only top-level headlines</td></tr>
<tr><td>Contents</td><td>All headlines at all levels</td></tr>
<tr><td>Show All</td><td>Everything expanded</td></tr>
</tbody>
</table>

</div>
<div id="org-visibility-commands" class="org-section org-level-2">
<h2>✅ Visibility Commands</h2>
<p>CLOSED: [2026-01-15 Thu 14:26]</p>

<table class="org-table">
<thead>
<tr><th>Key</th><th>Command</th></tr>
</thead>
<tbody>
<tr><td>Tab</td><td>Cycle visibility at current heading</td></tr>
<tr><td>Shift+Tab</td><td>Cycle global visibility</td></tr>
</tbody>
</table>

<p>Additional visibility can be controlled through speed commands (see <a href="speed-commands.html">Speed Commands</a>):</p>

<table class="org-table">
<thead>
<tr><th>Speed Key</th><th>Action</th></tr>
</thead>
<tbody>
<tr><td>c</td><td>Cycle visibility</td></tr>
<tr><td>Shift+C</td><td>Show children</td></tr>
<tr><td>o</td><td>Overview (fold all)</td></tr>
</tbody>
</table>

</div>
</div>
<div id="org-motion-between-headlines" class="org-section org-level-1">
<h1>✅ Motion Between Headlines</h1>
<p>CLOSED: [2026-01-15 Thu 14:27]</p>

<p>Efficient navigation between headlines is essential for working with large
documents.</p>

<div id="org-navigation-commands" class="org-section org-level-2">
<h2>✅ Navigation Commands</h2>
<p>CLOSED: [2026-01-15 Thu 14:27]</p>

<table class="org-table">
<thead>
<tr><th>Key</th><th>Command</th></tr>
</thead>
<tbody>
<tr><td>Ctrl+C Ctrl+J</td><td>Jump to any heading (with menu)</td></tr>
<tr><td>Next/Previous heading</td><td>Built-in VS Code outline</td></tr>
</tbody>
</table>

</div>
<div id="org-using-the-outline-view" class="org-section org-level-2">
<h2>✅ Using the Outline View</h2>
<p>CLOSED: [2026-01-15 Thu 14:27]</p>

<p>The VS Code Outline view provides visual navigation:</p>

<ol>
<li><p>Open the Outline view (sidebar or Cmd/Ctrl+Shift+O)</p>
</li>
<li><p>Click any heading to jump to it</p>
</li>
<li><p>Use the filter box to search headings</p>
</li>
</ol>

</div>
<div id="org-jump-to-heading" class="org-section org-level-2">
<h2>✅ Jump to Heading</h2>
<p>CLOSED: [2026-01-15 Thu 14:27]</p>

<p>Press Ctrl+C Ctrl+J to open a quick-pick menu of all headings. Type to filter
and press Enter to jump.</p>

</div>
<div id="org-speed-command-navigation" class="org-section org-level-2">
<h2>✅ Speed Command Navigation</h2>
<p>CLOSED: [2026-01-15 Thu 14:27]</p>

<p>With speed commands enabled (scimax.speedCommands.enabled: true), when your
cursor is at the beginning of a headline, single keys navigate:</p>

<table class="org-table">
<thead>
<tr><th>Key</th><th>Action</th></tr>
</thead>
<tbody>
<tr><td>n</td><td>Next heading (any level)</td></tr>
<tr><td>p</td><td>Previous heading (any level)</td></tr>
<tr><td>f</td><td>Next heading (same level - forward)</td></tr>
<tr><td>b</td><td>Previous heading (same level - back)</td></tr>
<tr><td>u</td><td>Up to parent heading</td></tr>
<tr><td>j</td><td>Jump to heading (opens menu)</td></tr>
<tr><td>g</td><td>Go to... (opens navigation menu)</td></tr>
</tbody>
</table>

</div>
</div>
<div id="org-structure-editing" class="org-section org-level-1">
<h1>✅ Structure Editing</h1>
<p>CLOSED: [2026-01-15 Thu 14:28]</p>

<p>Scimax VS Code provides commands to restructure your document without
manual cut-and-paste.</p>

<div id="org-promote-demote-headlines" class="org-section org-level-2">
<h2>✅ Promote/Demote Headlines</h2>
<p>CLOSED: [2026-01-15 Thu 14:28]</p>

<p>Change the level of a headline:</p>

<table class="org-table">
<thead>
<tr><th>Key</th><th>Command</th></tr>
</thead>
<tbody>
<tr><td>Alt+Left</td><td>Promote heading (decrease level)</td></tr>
<tr><td>Alt+Right</td><td>Demote heading (increase level)</td></tr>
<tr><td>Alt+Shift+Left</td><td>Promote subtree</td></tr>
<tr><td>Alt+Shift+Right</td><td>Demote subtree</td></tr>
</tbody>
</table>

<div id="org-single-heading-vs-subtree" class="org-section org-level-3">
<h3>✅ Single Heading vs Subtree</h3>
<p>CLOSED: [2026-01-15 Thu 14:28]</p>

<ul>
<li><p><strong>Promote/Demote Heading</strong>: Changes only the current headline&#39;s level</p>
</li>
<li><p><strong>Promote/Demote Subtree</strong>: Changes the headline AND all its children</p>
</li>
</ul>

<p>Example - promoting a subtree:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,** Parent                    * Parent
,*** Child 1          -&gt;       ** Child 1
,*** Child 2                  ** Child 2</code></pre>
</div>

</div>
</div>
<div id="org-move-subtrees-up-down" class="org-section org-level-2">
<h2>⚠️ Move Subtrees Up/Down</h2>
<p>Reorder sections without changing their level:</p>

<table class="org-table">
<thead>
<tr><th>Key</th><th>Command</th></tr>
</thead>
<tbody>
<tr><td>Alt+Up</td><td>Move subtree up (swap with previous)</td></tr>
<tr><td>Alt+Down</td><td>Move subtree down (swap with next)</td></tr>
</tbody>
</table>

<p>The entire subtree (heading and all its content/children) moves together.</p>

</div>
