docs-html/document-structure.html
<div id="org-kill-clone-subtrees" class="org-section org-level-2">
<h2>✅ Kill/Clone Subtrees</h2>
<p>CLOSED: [2026-01-15 Thu 14:31]</p>

<table class="org-table">
<thead>
<tr><th>Command</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td>scimax.org.killSubtree</td><td>Cut the current subtree</td></tr>
<tr><td>scimax.org.cloneSubtree</td><td>Duplicate the current subtree</td></tr>
</tbody>
</table>

<p>Speed command keys (at heading start):</p>

<table class="org-table">
<thead>
<tr><th>Key</th><th>Action</th></tr>
</thead>
<tbody>
<tr><td>w</td><td>Kill (cut) subtree</td></tr>
<tr><td>Shift+W</td><td>Clone (duplicate) subtree</td></tr>
<tr><td>y</td><td>Yank (paste) subtree</td></tr>
</tbody>
</table>

</div>
<div id="org-insert-new-headings" class="org-section org-level-2">
<h2>✅ Insert New Headings</h2>
<p>CLOSED: [2026-01-15 Thu 14:31]</p>

<table class="org-table">
<thead>
<tr><th>Key</th><th>Command</th></tr>
</thead>
<tbody>
<tr><td>Ctrl+Enter</td><td>Insert heading at same level</td></tr>
</tbody>
</table>

<p>The command scimax.org.insertHeading inserts a new heading. The behavior
depends on context:</p>

<ul>
<li><p>On a heading line: Insert new heading at same level</p>
</li>
<li><p>In body text: Insert new heading after current section</p>
</li>
</ul>

<p>For subheadings:</p>

<table class="org-table">
<thead>
<tr><th>Command</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td>scimax.org.insertSubheading</td><td>Insert heading one level deeper</td></tr>
</tbody>
</table>

</div>
</div>
<div id="org-document-keywords" class="org-section org-level-1">
<h1>✅ Document Keywords</h1>
<p>CLOSED: [2026-01-15 Thu 14:32]</p>

<p>Document keywords appear at the beginning of the file and configure
document-wide settings.</p>

<div id="org-common-keywords" class="org-section org-level-2">
<h2>✅ Common Keywords</h2>
<p>CLOSED: [2026-01-15 Thu 14:32]</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+TITLE: Document Title
,#+AUTHOR: Author Name
,#+DATE: 2026-01-13
,#+EMAIL: author@example.com</code></pre>
</div>

</div>
<div id="org-options-keyword" class="org-section org-level-2">
<h2>✅ Options Keyword</h2>
<p>CLOSED: [2026-01-15 Thu 14:32]</p>

<p>The #+OPTIONS: keyword controls export and display behavior:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+OPTIONS: toc:2 num:t H:4 ^:nil</code></pre>
</div>

<table class="org-table">
<thead>
<tr><th>Option</th><th>Values</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td>toc</td><td>t, nil, number</td><td>Table of contents depth</td></tr>
<tr><td>num</td><td>t, nil</td><td>Section numbering</td></tr>
<tr><td>H</td><td>number</td><td>Headline levels for export</td></tr>
<tr><td>^</td><td>t, nil, {}</td><td>Subscript/superscript handling</td></tr>
<tr><td>author</td><td>t, nil</td><td>Include author in export</td></tr>
<tr><td>date</td><td>t, nil</td><td>Include date in export</td></tr>
</tbody>
</table>

</div>
<div id="org-startup-keyword" class="org-section org-level-2">
<h2>⚠️ Startup Keyword</h2>
<p>Control initial visibility:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+STARTUP: overview    # Start with all headings folded
,#+STARTUP: content     # Show all headings, hide body
,#+STARTUP: showall     # Show everything</code></pre>
</div>

</div>
<div id="org-property-keyword" class="org-section org-level-2">
<h2>⚠️ Property Keyword</h2>
<p>Set default properties for source blocks:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+PROPERTY: header-args :exports both
,#+PROPERTY: header-args:python :session *python*</code></pre>
</div>

</div>
</div>
<div id="org-properties-drawers" class="org-section org-level-1">
<h1>✅ Properties Drawers</h1>
<p>CLOSED: [2026-01-15 Thu 14:32]</p>

<p>Properties drawers store metadata about a headline in key-value pairs.</p>

<div id="org-creating-properties-drawers" class="org-section org-level-2">
<h2>✅ Creating Properties Drawers</h2>
<p>CLOSED: [2026-01-15 Thu 14:32]</p>

<p>Properties appear in a :PROPERTIES: drawer immediately after the headline:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* My Headline
:PROPERTIES:
:CUSTOM_ID: my-headline
:CATEGORY: work
:EFFORT: 2:00
:END:</code></pre>
</div>

</div>
<div id="org-special-properties" class="org-section org-level-2">
<h2>✅ Special Properties</h2>
<p>CLOSED: [2026-01-15 Thu 14:33]</p>

<p>Certain properties have special meaning:</p>

<table class="org-table">
<thead>
<tr><th>Property</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td>ID</td><td>Globally unique identifier (UUID)</td></tr>
<tr><td>CUSTOM_ID</td><td>Document-unique identifier for linking</td></tr>
<tr><td>CATEGORY</td><td>Category for agenda views</td></tr>
<tr><td>EFFORT</td><td>Estimated time (H:MM format)</td></tr>
<tr><td>COLUMNS</td><td>Column view format specification</td></tr>
<tr><td>VISIBILITY</td><td>Initial visibility (folded, children, all)</td></tr>
</tbody>
</table>

</div>
<div id="org-adding-properties" class="org-section org-level-2">
<h2>✅ Adding Properties</h2>
<p>CLOSED: [2026-01-15 Thu 14:33]</p>

<p>To add a property via speed commands, press Shift+P at a heading start.</p>

<p>You can also add properties manually by typing inside the drawer.</p>

</div>
<div id="org-inherited-properties" class="org-section org-level-2">
<h2>⚠️ Inherited Properties</h2>
<p>Some properties are inherited by child headlines. The CATEGORY property, for
example, applies to all children unless overridden.</p>

</div>
</div>
<div id="org-drawers" class="org-section org-level-1">
<h1>⚠️ Drawers</h1>
<p>Drawers are collapsible sections that hide auxiliary information.</p>

<div id="org-standard-drawers" class="org-section org-level-2">
<h2>⚠️ Standard Drawers</h2>
<div id="org-properties-drawer" class="org-section org-level-3">
<h3>⚠️ PROPERTIES Drawer</h3>
<p>Stores headline metadata (see above).</p>

</div>
<div id="org-logbook-drawer" class="org-section org-level-3">
<h3>⚠️ LOGBOOK Drawer</h3>
<p>Stores clock entries and state change history:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* TODO My Task
:LOGBOOK:
CLOCK: [2026-01-13 Mon 09:00]--[2026-01-13 Mon 10:30] =&gt;  1:30
- State &quot;TODO&quot;       from &quot;WAITING&quot;    [2026-01-12 Sun 14:00]
:END:</code></pre>
</div>

</div>
</div>
<div id="org-custom-drawers" class="org-section org-level-2">
<h2>⚠️ Custom Drawers</h2>
<p>Create custom drawers for any purpose:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* Research Notes
:NOTES:
These are private notes that won&#39;t be exported.
- Reference: Smith et al. 2024
- Follow up with collaborator
:END:

:REFERENCES:
- [[cite:smith-2024]]
- [[cite:jones-2023]]
:END:</code></pre>
</div>

<p>Drawer names must be uppercase letters and can contain numbers and underscores.</p>

</div>
<div id="org-drawer-visibility" class="org-section org-level-2">
<h2>⚠️ Drawer Visibility</h2>
<p>Drawers are typically displayed collapsed. Click or use fold commands to
expand/collapse them.</p>

</div>
</div>
<div id="org-inline-tasks" class="org-section org-level-1">
<h1>✅ Inline Tasks</h1>
<p>CLOSED: [2026-01-15 Thu 14:34]</p>

<p>Inline tasks are special headlines at a very deep level (default: 15 stars or
more) that are treated as inline content within a section rather than as
document structure.</p>

<div id="org-creating-inline-tasks" class="org-section org-level-2">
<h2>✅ Creating Inline Tasks</h2>
<p>CLOSED: [2026-01-15 Thu 14:34]</p>

<p>An inline task uses many stars (15+) and has a matching END marker:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,* Main Headline
Content of the headline.

,*************** TODO Quick inline task
This is an inline task that doesn&#39;t affect document structure.
It&#39;s useful for small, self-contained TODOs within prose.
,*************** END

More content continues here.</code></pre>
</div>

</div>
<div id="org-inline-task-features" class="org-section org-level-2">
<h2>✅ Inline Task Features</h2>
<p>CLOSED: [2026-01-15 Thu 14:34]</p>

<p>Inline tasks support the same features as regular headlines:</p>

<table class="org-table">
<thead>
<tr><th>Feature</th><th>Example</th></tr>
</thead>
<tbody>
<tr><td>TODO state</td><td>*************** TODO Task</td></tr>
<tr><td>Priority</td><td>*************** [#A] High priority</td></tr>
<tr><td>Tags</td><td>*************** Task :urgent:work:</td></tr>
<tr><td>Body text</td><td>Content between task and END</td></tr>
</tbody>
</table>

</div>
<div id="org-when-to-use-inline-tasks" class="org-section org-level-2">
<h2>✅ When to Use Inline Tasks</h2>
<p>CLOSED: [2026-01-15 Thu 14:35]</p>

<ul>
<li><p>Quick TODOs embedded in documentation</p>
</li>
<li><p>Small tasks that don&#39;t warrant their own section</p>
</li>
<li><p>Notes or reminders within prose</p>
</li>
<li><p>Tasks that shouldn&#39;t appear in document outline</p>
</li>
</ul>

</div>
<div id="org-configuration" class="org-section org-level-2">
<h2>✅ Configuration</h2>
<p>CLOSED: [2026-01-15 Thu 14:35]</p>

<p>The minimum headline level for inline tasks is configurable. By default,
headlines with 15 or more stars are treated as inline tasks.</p>

</div>
</div>
<div id="org-footnote-definitions" class="org-section org-level-1">
<h1>✅ Footnote Definitions</h1>
<p>CLOSED: [2026-01-15 Thu 14:35]</p>

<p>Footnotes allow you to add supplementary information without interrupting
the main text flow.</p>
