docs-html/document-structure.html

<div id="org-footnote-definition-syntax" class="org-section org-level-2">
<h2>✅ Footnote Definition Syntax</h2>
<p>CLOSED: [2026-01-15 Thu 14:35]</p>

<p>Footnotes are defined with [fn:LABEL] at the start of a line:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">This paragraph has a footnote reference[fn:1].

[fn:1] This is the footnote content. It can span
  multiple lines if subsequent lines are indented.

Another paragraph continues here.</code></pre>
</div>

</div>
<div id="org-footnote-labels" class="org-section org-level-2">
<h2>✅ Footnote Labels</h2>
<p>CLOSED: [2026-01-15 Thu 14:35]</p>

<p>Footnotes can use numeric or named labels:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">See the paper for details[fn:1].
This is a key concept[fn:important-note].

[fn:1] Smith et al., 2024.
[fn:important-note] A named footnote for easy reference.</code></pre>
</div>

</div>
<div id="org-multi-line-footnotes" class="org-section org-level-2">
<h2>✅ Multi-line Footnotes</h2>
<p>CLOSED: [2026-01-15 Thu 14:35]</p>

<p>Footnote definitions can span multiple lines with indentation:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">[fn:long-note] This is a longer footnote that spans
  multiple lines. All continuation lines must be
  indented to be included in the footnote.

  You can even have multiple paragraphs by leaving
  a blank line with proper indentation.</code></pre>
</div>

</div>
<div id="org-inline-footnotes" class="org-section org-level-2">
<h2>✅ Inline Footnotes</h2>
<p>CLOSED: [2026-01-15 Thu 14:35]</p>

<p>For short footnotes, use inline syntax:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">This has an inline footnote[fn:: This is the definition].</code></pre>
</div>

</div>
<div id="org-related-topics" class="org-section org-level-2">
<h2>✅ Related Topics</h2>
<p>CLOSED: [2026-01-15 Thu 14:35]</p>

<p>See <a href="links.html">Links</a> for information on footnote references.</p>

</div>
</div>
<div id="org-dynamic-blocks" class="org-section org-level-1">
<h1>✅ Dynamic Blocks</h1>
<p>CLOSED: [2026-01-15 Thu 14:35]</p>

<p>Dynamic blocks are special regions whose content is generated programmatically.
They are defined with #+BEGIN: and #+END: markers.</p>

<div id="org-dynamic-block-syntax" class="org-section org-level-2">
<h2>✅ Dynamic Block Syntax</h2>
<p>CLOSED: [2026-01-15 Thu 14:35]</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+BEGIN: block-name parameters
Content that will be replaced when block is updated.
,#+END:</code></pre>
</div>

</div>
<div id="org-clock-table-example" class="org-section org-level-2">
<h2>✅ Clock Table Example</h2>
<p>CLOSED: [2026-01-15 Thu 14:35]</p>

<p>The most common dynamic block is the clock table, which summarizes time spent:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+BEGIN: clocktable :maxlevel 2 :scope file
| Headline          | Time   |
|-------------------+--------|
| * Project work    |  10:30 |
| ** Implementation |   6:00 |
| ** Testing        |   4:30 |
,#+END:</code></pre>
</div>

</div>
<div id="org-column-view-example" class="org-section org-level-2">
<h2>⚠️ Column View Example</h2>
<p>Column view displays properties in a table format:</p>

<table class="org-table">
<thead>
<tr><th>ITEM</th><th>EFFORT</th><th>PRIORITY</th></tr>
</thead>
<tbody>
<tr><td>Task 1</td><td>2:00</td><td>A</td></tr>
<tr><td>Task 2</td><td>1:30</td><td>B</td></tr>
</tbody>
</table>


</div>
<div id="org-dynamic-block-parameters" class="org-section org-level-2">
<h2>⚠️ Dynamic Block Parameters</h2>
<p>Common parameters for clock tables:</p>

<table class="org-table">
<thead>
<tr><th>Parameter</th><th>Description</th><th>Example</th></tr>
</thead>
<tbody>
<tr><td>:maxlevel</td><td>Maximum headline depth</td><td>:maxlevel 3</td></tr>
<tr><td>:scope</td><td>Scope of clock data</td><td>:scope file</td></tr>
<tr><td>:tstart</td><td>Start time for report</td><td>:tstart &quot;&lt;-1w&gt;&quot;</td></tr>
<tr><td>:tend</td><td>End time for report</td><td>:tend &quot;&lt;now&gt;&quot;</td></tr>
<tr><td>:block</td><td>Time block (today, thisweek, etc.)</td><td>:block thisweek</td></tr>
</tbody>
</table>

</div>
<div id="org-updating-dynamic-blocks" class="org-section org-level-2">
<h2>⚠️ Updating Dynamic Blocks</h2>
<p>Dynamic blocks are updated when explicitly requested. The content between</p>

</div>
</div>
<div id="org-best-practices" class="org-section org-level-1">
<h1>✅ Best Practices</h1>
<p>CLOSED: [2026-01-15 Thu 14:38]</p>

<div id="org-document-organization" class="org-section org-level-2">
<h2>✅ Document Organization</h2>
<p>CLOSED: [2026-01-15 Thu 14:38]</p>

<ol>
<li><p><strong>Start with an outline</strong> - Create your heading structure before adding content</p>
</li>
<li><p><strong>Use consistent levels</strong> - Don&#39;t skip levels arbitrarily</p>
</li>
<li><p><strong>Keep headings concise</strong> - Use brief, descriptive titles</p>
</li>
<li><p><strong>Use tags for cross-cutting concerns</strong> - Don&#39;t rely solely on hierarchy</p>
</li>
</ol>

</div>
<div id="org-heading-depth-guidelines" class="org-section org-level-2">
<h2>✅ Heading Depth Guidelines</h2>
<p>CLOSED: [2026-01-15 Thu 14:38]</p>

<table class="org-table">
<thead>
<tr><th>Level</th><th>Typical Use</th></tr>
</thead>
<tbody>
<tr><td>1</td><td>Major sections/chapters</td></tr>
<tr><td>2</td><td>Subsections</td></tr>
<tr><td>3</td><td>Topics within subsections</td></tr>
<tr><td>4</td><td>Detailed points</td></tr>
<tr><td>5+</td><td>Rarely needed; consider restructuring</td></tr>
</tbody>
</table>

</div>
<div id="org-navigation-efficiency" class="org-section org-level-2">
<h2>✅ Navigation Efficiency</h2>
<p>CLOSED: [2026-01-15 Thu 14:38]</p>

<ol>
<li><p><strong>Use Ctrl+C Ctrl+J</strong> for direct jumps to any heading</p>
</li>
<li><p><strong>Use outline view</strong> for visual navigation in long documents</p>
</li>
<li><p><strong>Enable speed commands</strong> for rapid single-key navigation</p>
</li>
<li><p><strong>Use Shift+Tab</strong> to get an overview before diving in</p>
</li>
</ol>

</div>
</div>
<div id="org-related-topics" class="org-section org-level-1">
<h1>✅ Related Topics</h1>
<p>CLOSED: [2026-01-15 Thu 14:38]</p>

<ul>
<li><p><a href="todo-items.html">TODO Items</a> - Task states and priorities in headlines</p>
</li>
<li><p><a href="timestamps.html">Timestamps</a> - Adding dates to headlines</p>
</li>
<li><p><a href="links.html">Links</a> - Linking to headlines</p>
</li>
<li><p><a href="speed-commands.html">Speed Commands</a> - Single-key commands at headlines</p>
</li>
<li><p><a href="export.html">Export</a> - How structure affects exported documents</p>
</li>
</ul>

</div>
<div id="org-navigation" class="org-section org-level-1">
<h1>👀 Navigation</h1>
<ul>
<li><p>Previous: <a href="getting-started.html">Getting Started</a></p>
</li>
<li><p>Next: <a href="todo-items.html">TODO Items</a></p>
</li>
</ul>

</div>
</main>
</body>
</html>